package 개념정리.인프런.자료구조;

public class 스택과_큐 {
    /*
    스택, 큐 : 배열에서 발전된 형태의 자료구조

    스택
    삽입과 삭제연산이 후입선출(FILO)로 이뤄지는 자료구조
    삽입과 삭제가 한쪽에서만 일어나는 특징

   top: 삽입과 삭제가 일어나는 위치
   push: top위치에 새로운 데이터 삽입
   pop: 데이터 삭제, 확인
   peek:top위치에 있는 현재 데이터 확인

   깊이우선탐색(DFS), 백트래킹 종류 코딩테스트에 효과적
   재귀함수 알고리즘 원리와 비슷

   큐
   삽입과 삭제 연산이 선입선출 : FIFO
   삽입과 삭제가 양방향에서 이뤄짐

   rear: 가장 끝 데이터
   front: 가장 앞 데이터
   add: rear부분에 데이터 삽입
   poll: 데이터 삭제하고 확인
   peek: front에 있는 데이터를 확인할 때 사용

   너비우선탐색(BFS)에서 자주 사용

   *우선순위큐
   들어간 순서와 상관없이 우선순위가 높은 데이터가 먼저 나오는 자료구조
   큐 설정에 따라 front에 항상 최댓값 또는 최솟값이 위치
    -> 힙 자료구조 = 트리구조

     */
}
